Repository: SemkiShow/TimetableGenerator
Catalog: resources/locales/*/LC_MESSAGES/TimetableGenerator.po
Languages: be, pl, ru

source: Combine lessons
be: Аб’яднаць урокі
pl: Połącz lekcje
ru: Объединить уроки

source: Ok
be: Ок
ru: Ок

source: Cancel
be: Адмена
pl: Anuluj
ru: Отмена

source: New rule
be: Новае правіла
pl: Nowa zasada
ru: Новое правило

source: Edit rule
be: Рэдагаваць правіла
pl: Edytuj zasadę
ru: Редактировать правило

source: preserve order
be: захаваць парадак
pl: zachowaj kolejność
ru: сохранить порядок

source: amount
be: колькасць
pl: ilość
ru: количество

source: none
be: няма
pl: brak
ru: нет

source: error
be: памылка
pl: błąd
ru: ошибка

source: abcdefghijklmnopqrstuvwxyz
be: абвгдежзіклмнопрстуфхцчш
ru: абвгдежзиклмнопрстуфхцчш

source: New class
be: Новы клас
pl: Nowa klasa
ru: Новый класс

source: Edit class
be: Рэдагаваць клас
pl: Edytuj klasę
ru: Редактировать класс

source: Warning: you are bulk editing classes! After pressing Ok ALL classes with the number below will be OVERWRITTEN with the data you enter. If you don't want that to happen, press the Cancel button.
be: Увага: вы масава рэдагуеце класы! Пасля націскання Ок УСЕ класы з указаным нумарам БУДУЦЬ ЗАМЕНЕНЫ на ўведзеныя дадзеныя. Калі вы не жадаеце гэтага, націсніце кнопку Адмена.
pl: Uwaga: edytujesz wiele klas jednocześnie! Po naciśnięciu OK WSZYSTKIE klasy z podanym numerem ZOSTANĄ NADPISANE wprowadzonymi danymi. Jeśli nie chcesz tego zrobić, naciśnij Anuluj.
ru: Внимание: вы массово редактируете классы! После нажатия Ок ВСЕ классы с номером ниже БУДУТ ПЕРЕЗАПИСАНЫ введёнными данными. Если вы не хотите этого, нажмите кнопку Отмена.

source: number
be: нумар
pl: numer
ru: номер

source: letter
be: літара
pl: litera
ru: буква

source: teacher
be: настаўнік
pl: nauczyciel
ru: учитель

source: available lessons
be: даступныя ўрокі
pl: dostępne lekcje
ru: доступные уроки

source: Deselect all
be: Зняць вылучэнне са ўсіх
pl: Odznacz wszystkie
ru: Снять выделение со всех

source: Select all
be: Выбраць усе
pl: Zaznacz wszystkie
ru: Выделить все

source: lessons
be: урокі
pl: lekcje
ru: уроки

source: Edit
be: Рэдагаваць
pl: Edytuj
ru: Редактировать

source: Warning: no teacher selected for this lesson
be: Папярэджанне: для гэтага ўрока не абраны настаўнік
pl: Uwaga: nie wybrano nauczyciela dla tej lekcji
ru: Предупреждение: для этого урока не выбран учитель

source: Add a lesson rule
be: Дадаць правіла ўрока
pl: Dodaj zasadę lekcji
ru: Добавить правило урока

source: Rules
be: Правілы
pl: Zasady
ru: Правила

source: Preserve order
be: Захаваць парадак
pl: Zachowaj kolejność
ru: Сохранить порядок

source: Amount
be: Колькасць
pl: Ilość
ru: Количество

source: Yes
be: Так
pl: Tak
ru: Да

source: No
be: Не
pl: Nie
ru: Нет

source: Classes
be: Класы
pl: Klasy
ru: Классы

source: Warning: changing the current year can be quite destructive. If something went wrong, press the Cancel button to revert all changes
be: Папярэджанне: змена бягучага года можа быць вельмі разбуральнай. Калі нешта пайшло не так, націсніце кнопку Скасаваць, каб вярнуць усе змены
pl: Uwaga: zmiana bieżącego roku może być bardzo destrukcyjna. Jeśli coś poszło nie tak, naciśnij przycisk Anuluj, aby cofnąć wszystkie zmiany
ru: Предупреждение: изменение текущего года может привести к потере данных. Если что-то пошло не так, нажмите кнопку Отмена, чтобы отменить все изменения

source: Back
be: Назад
pl: Wstecz
ru: Назад

source: Next
be: Далей
pl: Dalej
ru: Далее

source: New classroom
be: Новы кабінет
pl: Nowa sala
ru: Новый кабинет

source: Edit classroom
be: Рэдагаваць кабінет
pl: Edytuj salę
ru: Редактировать кабинет

source: start number
be: пачатковы нумар
pl: numer początkowy
ru: начальный номер

source: end number
be: канчатковы нумар
pl: numer końcowy
ru: конечный номер

source: name
be: назва
pl: nazwa
ru: название

source: Classrooms
be: Кабінеты
pl: Sale lekcyjne
ru: Кабинеты

source: New lesson
be: Новы ўрок
pl: Nowa lekcja
ru: Новый урок

source: Edit lesson
be: Рэдагаваць ўрок
pl: Edytuj lekcję
ru: Редактировать урок

source: classes
be: класы
pl: klasy
ru: классы

source: You need to add classes in the Classes menu to select classes for this lesson!
be: Неабходна дадаць класы у меню Класы каб выбраць класы для гэтага ўрока!
pl: Musisz dodać klasy w menu Klasy, aby wybrać klasy dla tej lekcji!
ru: Необходимо добавить классы в меню Классы чтобы выбрать классы для этого урока!

source: You need to add classrooms in the Classrooms menu to select classrooms for this lesson!
be: Неабходна дадаць кабінеты у меню Кабінеты каб выбраць кабінеты для гэтага ўрока!
pl: Musisz dodać sale lekcyjne w menu Sale lekcyjne, aby wybrać sale dla tej lekcji!
ru: Необходимо добавить кабинеты в меню Кабинеты чтобы выбрать кабинеты для этого урока!

source: Lessons
be: Урокі
pl: Lekcje
ru: Уроки

source: no lesson
be: няма ўрока
pl: brak lekcji
ru: нет урока

source: any lesson
be: любы ўрок
pl: dowolna lekcja
ru: любой урок

source: New teacher
be: Новы настаўнік
pl: Nowy nauczyciel
ru: Новый учитель

source: Edit teacher
be: Рэдагаваць настаўніка
pl: Edytuj nauczyciela
ru: Редактировать учителя

source: You need to add lessons in the Lessons menu to select lessons for this teacher!
be: Неабходна дадаць урокі у меню Урокі каб выбраць урокі для гэтага настаўніка!
pl: Musisz dodać lekcje w menu Lekcje, aby wybrać lekcje dla tego nauczyciela!
ru: Необходимо добавить уроки в меню Уроки чтобы выбрать уроки для этого учителя!

source: Teachers
be: Настаўнікі
pl: Nauczyciele
ru: Учителя

source: min free periods
be: мін. вольных вокнаў
pl: min. ilość okienek
ru: мин. количество форточек

source: max free periods
be: макс. вольных вокнаў
pl: maks. ilość okienek
ru: макс. количество форточек

source: Setup wizard
be: Майстар налад
pl: Kreator konfiguracji
ru: Мастер настройки

source: Generate timetable
be: Сгенераваць расклад
pl: Generuj plan lekcji
ru: Сгенерировать расписание

source: Press the Generate timetable button before exporting the timetable!
be: Націсніце кнопку Сгенераваць расклад перад экспартам раскладу!
pl: Naciśnij przycisk Generuj plan lekcji przed eksportowaniem planu!
ru: Нажмите кнопку Сгенерировать расписание перед экспортом расписания!

source: Crash report
be: Справаздача пра збой
pl: Raport awarii
ru: Отчет об ошибке

source: The program has crashed last time it was opened! If you would like to send an anonymous crash report, select the data you want to share (by sending a crash report you can help to make Timetable Generator even better)
be: Праграма аварыйна завяршыла працу падчас апошняга запуску! Калі вы хочаце адправіць ананімную справаздачу пра збой, абярыце даныя, якія вы жадаеце падзяліць (адпраўляючы справаздачу пра збой, вы дапамагаеце зрабіць Генератар Раскладаў яшчэ лепшым)
pl: Program uległ awarii podczas ostatniego uruchomienia! Jeśli chcesz wysłać anonimowy raport awarii, wybierz dane, które chcesz udostępnić (wysyłając raport awarii, możesz pomóc ulepszyć Generator Planów Lekcji)
ru: Программа завершила работу с ошибкой при последнем запуске! Если вы хотите отправить анонимный отчет об ошибке, выберите данные, которые хотите предоставить (отправляя отчет об ошибке, вы помогаете сделать Генератор Расписаний лучше)

source: send logs
be: адправіць запісы
pl: wyślij logi
ru: отправить журналы

source: send timetables
be: адправіць расклады
pl: wyślij plany lekcji
ru: отправить расписания

source: send settings
be: адправіць налады
pl: wyślij ustawienia
ru: отправить настройки

source: send basic system information
be: адправіць базавую інфармацыю пра сістэму
pl: wyślij podstawowe informacje o systemie
ru: отправить основную информацию о системе

source: Create crash_report.zip
be: Стварыць crash_report.zip
pl: Utwórz crash_report.zip
ru: Создать crash_report.zip

source: After pressing Create crash_report.zip email crash_report.zip to mgdeveloper123@gmail.com The email theme should be Timetable Generator crash report You can also provide a crash report description
be: Пасля націскання «Стварыць crash_report.zip» адпраўце файл crash_report.zip на mgdeveloper123@gmail.com Тэма ліста павінна быць: Генератар Раскладу Справаздача пра збой Вы таксама можаце дадаць апісанне збою
pl: Po naciśnięciu Utwórz crash_report.zip wyślij plik crash_report.zip na adres mgdeveloper123@gmail.com Temat e-maila powinien brzmieć: Generator Planów Lekcji Raport awarii Możesz również dołączyć opis awarii
ru: После нажатия «Создать crash_report.zip» отправьте файл crash_report.zip на адрес mgdeveloper123@gmail.com Тема письма должна быть: Генератор Расписаний Отчет об ошибке Вы также можете добавить описание ошибки

source: Finding additional bonus points...
be: Пошук дадатковых бонусных балаў...
pl: Wyszukiwanie dodatkowych punktów bonusowych...
ru: Поиск дополнительных бонусных баллов...

source: Timetable generating done!
be: Генерацыя раскладу завершана!
pl: Generowanie planu zajęć zakończone!
ru: Генерация расписания завершена!

source: Allocating memory for the timetables...
be: Выдзяленне памяці для раскладаў...
pl: Przydzielanie pamięci dla planów zajęć...
ru: Выделение памяти для расписаний...

source: Generating a timetable that matches the requirements...
be: Генерацыя раскладу, які адпавядае патрабаванням...
pl: Generowanie planu zajęć zgodnego z wymaganiami...
ru: Генерация расписания, соответствующего требованиям...

source: Monday
be: Панядзелак
pl: Poniedziałek
ru: Понедельник

source: Tuesday
be: Аўторак
pl: Wtorek
ru: Вторник

source: Wednesday
be: Серада
pl: Środa
ru: Среда

source: Thursday
be: Чацвер
pl: Czwartek
ru: Четверг

source: Friday
be: Пятніца
pl: Piątek
ru: Пятница

source: Saturday
be: Субота
pl: Sobota
ru: Суббота

source: Sunday
be: Нядзеля
pl: Niedziela
ru: Воскресенье

source: dark
be: цёмны
pl: ciemny
ru: тёмный

source: light
be: светлы
pl: jasny
ru: светлый

source: classic
be: класічны
pl: klasyczny
ru: классический

source: Welcome to the TimetableGenerator setup wizard! The first step is to add classrooms. After you are done, press Ok and continue to the next step.
be: Вітаем у майстры налад Генератара Раскладаў! Першы крок — дадаць кабінеты. Пасля завяршэння націсніце Ок, каб перайсці да наступнага кроку.
pl: Witamy w kreatorze Generatora Planów Lekcji! Pierwszy krok to dodanie sal lekcyjnych. Po zakończeniu kliknij OK, aby przejść do następnego kroku.
ru: Добро пожаловать в мастер настройки Генератора Расписаний! Первый шаг — добавление кабинетов. После завершения нажмите Ок, чтобы перейти к следующему шагу.

source: The next step is to add classes. After you are done, press Ok and continue to the next step.
be: Наступны крок — дадаць класы. Пасля завяршэння націсніце Ок, каб перайсці да наступнага кроку.
pl: Następny krok to dodanie klas. Po zakończeniu kliknij OK, aby przejść do następnego kroku.
ru: Следующий шаг — добавление классов. После завершения нажмите Ок, чтобы перейти к следующему шагу.

source: The next step is to add lessons. After you are done, press Ok and continue to the next step.
be: Наступны крок — дадаць урокі. Пасля завяршэння націсніце Ок, каб перайсці да наступнага кроку.
pl: Następny krok to dodanie lekcji. Po zakończeniu kliknij OK, aby przejść do następnego kroku.
ru: Следующий шаг — добавление уроков. После завершения нажмите Ок, чтобы перейти к следующему шагу.

source: The next step is to add teachers. After you are done, press Ok and continue to the next step.
be: Наступны крок — дадаць настаўнікаў. Пасля завяршэння націсніце Ок, каб перайсці да наступнага кроку.
pl: Następny krok to dodanie nauczycieli. Po zakończeniu kliknij OK, aby przejść do następnego kroku.
ru: Следующий шаг — добавление учителей. После завершения нажмите Ок, чтобы перейти к следующему шагу.

source: The next step is to assign lessons to classes. After you are done, press Ok and continue to the next step.
be: Наступны крок — прызначыць урокі класам. Пасля завяршэння націсніце Ок, каб перайсці да наступнага кроку.
pl: Następny krok to przypisanie lekcji do klas. Po zakończeniu kliknij OK, aby przejść do następnego kroku.
ru: Следующий шаг — назначение уроков классам. После завершения нажмите Ок, чтобы перейти к следующему шагу.

source: You are done! Now press the Generate timetable button to begin the timetable finding process!
be: Гатова! Цяпер націсніце кнопку Сгенераваць расклад каб пачаць працэс падбору раскладу!
pl: Gotowe! Teraz kliknij przycisk Generuj plan lekcji, aby rozpocząć proces tworzenia planu!
ru: Готово! Теперь нажмите кнопку Сгенерировать расписание чтобы начать процесс подбора расписания!

source: Settings
be: Налады
pl: Ustawienia
ru: Настройки

source: days per week
be: дзён у тыдзень
pl: dni w tygodniu
ru: дней в неделю

source: lessons per day
be: урокаў у дзень
pl: lekcje dziennie
ru: уроков в день

source: style
be: стыль
pl: styl
ru: стиль

source: language
be: мова
pl: język
ru: язык

source: Developer options
be: Параметры распрацоўніка
pl: Opcje deweloperskie
ru: Опции разработчика

source: merged-font
be: аб’яднаны-шрыфт
pl: scalona-czcionka
ru: объединённый-шрифт

source: timetable-autosave-interval
be: інтэрвал-аўтазахавання-раскладу
pl: interwał-autozapisu-planu
ru: интервал-автосохранения-расписания

source: font-size
be: памер-шрыфта
pl: rozmiar-czcionki
ru: размер-шрифта

source: error-bonus-ratio
be: каэфіцыент-бонуса-за-памылкі
pl: współczynnik-punktów-bonusowych-za-błędy
ru: коэффициент-бонуса-за-ошибки

source: timetables-per-generation-step
be: крок-раскладаў-на-генерацыю
pl: krok-planów-na-generację
ru: шаг-расписаний-на-генерацию

source: min-timetables-per-generation
be: мін-раскладаў-на-генерацыю
pl: min-planów-na-generację
ru: мин-расписаний-на-генерацию

source: max-timetables-per-generation
be: макс-раскладаў-на-генерацыю
pl: maks-planów-na-generację
ru: макс-расписаний-на-генерацию

source: max-iterations
be: макс-ітэрацый
pl: maks-iteracji
ru: макс-итераций

source: additional-bonus-points
be: дадатковыя-бонусныя-балы
pl: dodatkowe-punkty-bonusowe
ru: дополнительные-бонусные-баллы

source: verbose-logging
be: падрабязнае-лагаванне
pl: szczegółowe-logi
ru: подробное-логирование

source: use-prereleases
be: выкарыстоўваць-прадвыпускі
pl: używaj-wersji-testowych
ru: использовать-предрелизы

source: About
be: Пра праграму
pl: O programie
ru: О программе

source: A tool for creating timetables easily
be: Інструмент для простага стварэння раскладаў
pl: Narzędzie do łatwego tworzenia planów lekcji
ru: Инструмент для простого создания расписаний

source: Developed by SemkiShow
be: Распрацавана SemkiShow
pl: Opracowane przez SemkiShow
ru: Разработано SemkiShow

source: Licensed under GPLv3 License
be: Ліцэнзавана па ліцэнзіі GPLv3
pl: Licencjonowane na GPLv3
ru: Лицензировано по лицензии GPLv3

source: Updates
be: Абнаўленні
pl: Aktualizacje
ru: Обновления

source: The latest version is
be: Апошняя версія
pl: Najnowsza wersja to
ru: Последняя версия

source: Your version is
be: Ваша версія
pl: Twoja wersja to
ru: Ваша версия

source: There are no new versions available
be: Новых версій няма
pl: Brak dostępnych nowych wersji
ru: Новых версий нет

source: loading...
be: загрузка...
pl: ładowanie...
ru: загрузка...

source: A new version is available!
be: Даступная новая версія!
pl: Dostępna jest nowa wersja!
ru: Доступна новая версия!

source: Release notes
be: Заўвагі да рэлізу
pl: Informacje o wydaniu
ru: Примечания к релизу

source: Update
be: Абнавіць
pl: Aktualizuj
ru: Обновить

source: New timetable
be: Новы расклад
pl: Nowy plan lekcji
ru: Новое расписание

source: Save timetable as
be: Захаваць расклад як
pl: Zapisz plan jako
ru: Сохранить расписание как

source: Enter the timetable name (for example, the name of the school)
be: Увядзіце назву раскладу (напрыклад, назву школы)
pl: Wpisz nazwę planu lekcji (na przykład nazwę szkoły)
ru: Введите название расписания (например, название школы)

source: Open timetable
be: Адкрыць расклад
pl: Otwórz plan lekcji
ru: Открыть расписание

source: Select a timetable to open
be: Абярыце расклад для адкрыцця
pl: Wybierz plan lekcji do otwarcia
ru: Выберите расписание для открытия

source: Iteration:
be: Ітэрацыя:
pl: Iteracja:
ru: Итерация:

source: The best score is
be: Лепшы вынік —
pl: Najlepszy wynik to
ru: Лучший результат

source: The best timetable has
be: Лепшы расклад змяшчае
pl: Najlepszy plan zawiera
ru: Лучшее расписание содержит

source: errors
be: памылак
pl: błędów
ru: ошибок

source: bonus points
be: бонусных балаў
pl: punktów bonusowych
ru: бонусных баллов

source: iterations have passed since last score improvement
be: ітэрацый з часу апошняга паляпшэння
pl: iteracji minęło od ostatniej poprawy wyniku
ru: итераций прошло с последнего улучшения

source: How do I contact the developer?
be: Як звязацца з распрацоўшчыкам?
pl: Jak skontaktować się z deweloperem?
ru: Как связаться с разработчиком?

source: You can contact me by sending an email to mgdeveloper123@gmail.com
be: Вы можаце звязацца са мной, даслаўшы ліст на адрас mgdeveloper123@gmail.com
pl: Możesz skontaktować się ze mną, wysyłając e-mail na adres mgdeveloper123@gmail.com
ru: Вы можете связаться со мной, отправив письмо на адрес mgdeveloper123@gmail.com

source: How do I add multiple lessons to one timetable cell?
be: Як дадаць некалькі ўрокаў у адну ячэйку раскладу?
pl: Jak dodać kilka lekcji do jednej komórki planu zajęć?
ru: Как добавить несколько уроков в одну ячейку расписания?

source: To add multiple lessons to one timetable cell, click Combine lessons while editing a class.
be: Каб дадаць некалькі ўрокаў у адну ячэйку, націсніце Аб’яднаць урокі падчас рэдагавання класа.
pl: Aby dodać kilka lekcji do jednej komórki planu, kliknij Połącz lekcje podczas edycji klasy.
ru: Чтобы добавить несколько уроков в одну ячейку, нажмите Объединить уроки при редактировании класса.

source: Select the lessons and teachers to combine and press Ok.
be: Выберыце ўрокі і настаўнікаў для аб’яднання і націсніце OK.
pl: Wybierz lekcje i nauczycieli do połączenia i kliknij OK.
ru: Выберите уроки и учителей для объединения и нажмите ОК.

source: Then set the amount per week for the created combined lesson.
be: Потым задайце колькасць заняткаў у тыдзень для створанага аб’яднанага ўрока.
pl: Następnie ustaw liczbę godzin tygodniowo dla utworzonej lekcji łączonej.
ru: Затем укажите количество занятий в неделю для созданного объединённого урока.

source: File
be: Файл
pl: Plik
ru: Файл

source: New
be: Новы
pl: Nowy
ru: Новый

source: Open
be: Адкрыць
pl: Otwórz
ru: Открыть

source: Save
be: Захаваць
pl: Zapisz
ru: Сохранить

source: Save As
be: Захаваць як
pl: Zapisz jako
ru: Сохранить как

source: Export As
be: Экспартаваць як
pl: Eksportuj jako
ru: Экспортировать как

source: Help
be: Дапамога
pl: Pomoc
ru: Помощь

source: Check for updates
be: Праверыць абнаўленні
pl: Sprawdź aktualizacje
ru: Проверить обновления

source: Error: CURL init failed!
be: Памылка: ініцыялізацыя CURL не ўдалася!
pl: Błąd: inicjalizacja CURL nie powiodła się!
ru: Ошибка: не удалось инициализировать CURL!

source: Error: network request failed!
be: Памылка: сеткавы запыт не ўдалы!
pl: Błąd: żądanie sieciowe nie powiodło się!
ru: Ошибка: сбой сетевого запроса!

source: Error: no valid new version found!
be: Памылка: не знойдзена сапраўднай новай версіі!
pl: Błąd: nie znaleziono poprawnej nowej wersji!
ru: Ошибка: не найдена корректная новая версия!

source: Error: bad HTTP status!
be: Памылка: няправільны статус HTTP!
pl: Błąd: zły status HTTP!
ru: Ошибка: неверный HTTP статус!

source: Fetching the latest version URL...
be: Атрыманне URL апошняй версіі...
pl: Pobieranie adresu najnowszej wersji...
ru: Получение URL последней версии...

source: Failed to get archive URL
be: Не ўдалося атрымаць URL архіва
pl: Nie udało się pobrać adresu archiwum
ru: Не удалось получить URL архива

source: Downloading the latest version...
be: Спампоўка апошняй версіі...
pl: Pobieranie najnowszej wersji...
ru: Загрузка последней версии...

source: Failed to download the release!
be: Не ўдалося спампаваць рэліз!
pl: Nie udało się pobrać wydania!
ru: Не удалось загрузить релиз!

source: Unzipping the release...
be: Распакоўка рэлізу...
pl: Rozpakowywanie wydania...
ru: Распаковка релиза...

source: Failed to unzip the release!
be: Не ўдалося распакаваць рэліз!
pl: Nie udało się rozpakować wydania!
ru: Не удалось распаковать релиз!

source: Successfully updated to
be: Паспяхова абноўлена да
pl: Zaktualizowano pomyślnie do
ru: Успешно обновлено до

source: Restart the application to see the new features
be: Перазапусціце праграму, каб убачыць новыя функцыі
pl: Zrestartuj aplikację, aby zobaczyć nowe funkcje
ru: Перезапустите приложение, чтобы увидеть новые функции

source: Timetable Generator
be: Генератар Раскладаў
pl: Generator Planów Lekcji
ru: Генератор Расписаний
